import React from 'react';
import { useDispatch } from 'react-redux';
import { setReturnPolicyState } from '../store/actions';

const Policies = () => {
    const dispatch = useDispatch();
    return (
        <div className="returnPolicyFloat">
            <span className="cursor" onClick={() => dispatch(setReturnPolicyState(false))}>X</span>
            <p id="title"> מדיניות משלוחים והחזרות : </p>
            <p>
                כל המוצרים נעשים בעבודת  יד מלאה שלי לכן זמן הכנה משוער בין 5-7 ימי עסקים.
                לאחר שההזמנה מוכנה :
                איסוף עצמי מתל מונד בחינם.
                משלוח בדואר תוך 3 ימי עסקים בתוספת של 25 שקלים-
                בקנייה מעל 300 משלוח בחינם.
                יש לקחת בחשבון כי יתכנו שינויים ועיכובים בזמן ההכנה והאספקה של המוצר ,
                כמובן שאני עושה את כל המאמצים על מנת לספק את המוצרים בזמן המהיר ביותר .
                לתיאום של איסוף עצמי או לכל בעיה / שאלה ניתן לפנות אלי בוואצאפ 0546491136 / אינסטגרם - KAMAJEWELRY .
            </p>
            החלפות והחזרות -
            ניתן להחזיר/ להחליף פריט שנקנה באתר תוך 14 ימי עסקים מרגע הקבלה של הפריט .
            במידה והטבעת הגיעה במידה שלא טובה/ נוחה תינתן האפשרות של החלפת מידה בחינם באמצעות הגעה
            לבית שלי/ שליחת התכשיט בדואר בצירוף המידה המתאימה ומספר מעקב .
            בהחזרה יש  לציין-
            שם מלא
            מספר טלפון
            מספר הזמנה
            כתובת
            את שמו של הפריט אליו תרצו להחליף והמידה הנכונה .
            *עלות המשלוח בעת החזרה/החלפה/תיקון תחול על הלקוח/ה בלבד - עלות החזרת הפריטים לאחר התיקון תחול עלי בלבד .
            יש להחזיר את התכשיטים לכתובת הבאה:
            שקד לחמי
            לכיש 4 תל מונד
            נייד- 0546491136
            חשוב לדעת- כל התכשיטים נעשים בעבודת יד מלאה לכן קיימת אפשרות
            שהתכשיט יהיה שונה מעט מן התמונות המופיעות באתר.
            אחריות :
            כל התכשיטים עשויים מכסף 925 - עמידים במים וניתן להתקלח איתם.
            רצוי לא להיכנס איתם לים/ לבריכה , לשים עליהם בושם/קרמים מכל הסוגים.
            יש אחריות של שנה מיום הקניה.
            האחריות שמגיעה עם כל תכשיט שנרכש מכסה כל תיקון שכולל-
            טבעות - שבר/ קרע בטבעת/ החלפת מידה ראשונה.
            שרשראות - החלפה / תיקון של הסוגר .
            עגילים - שבר של הפוסט ( החלק שנכנס לאוזן)
            צמידים - שבר/ קרע בצמיד
            *כל התיקון אחר יהיה בתוספת תשלום .


        </div>
    );
};

export default Policies;