import React from 'react';

function About(props: any) {
    return (
        <div dir='rtl'>
            פירוש המילה KAMA בעולם היוגה הוא תשוקה .

            תכשיטים מאז שאני זוכרת את עצמי היו התשוקה הכי גדולה , לא הייתי יוצאת מהבית בלי טבעת בכל אצבע לפחות אפילו לטיולים בצופים .

            תכשיטים הם דרך מאוד יפה לבטא את עצמך את מי שאת ומה שאת רוצה להיות .

            מהרגע הראשון שראיתי פלטה של כסף הרגשתי אותה ניסרתי אותה ויצרתי ממנה משהו שהוא לגמרי שלי , הבנתי שזה מה שאני רוצה לעשות ושום דבר לא משתווה להרגשה הזאת ,.

            מקווה שתהנו מהתכשיטים שלי כמוני .

            * כל התכשיטים נעשים בעבודת יד מלאה מכסף 925 , ועמידים במים.
        </div>
    );
}

export default About;